rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
/**
  ******************************************************************************
  * @file    debug_pwr_rcc.c
  * @author  Rainer
  * @brief   Miscellaneous tools for debug output
  *
  ******************************************************************************
  *
  ******************************************************************************
  */

/** @addtogroup DEBUG_UTILS
  * @{
  */

#include "debug.h"

#if DEBUG_FEATURES > 0 

#include "hardware.h"

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

#include "debug_helper.h"
#include "rtc.h"
#include "system/pll.h"

#define DEBUG_DUMP_PWR      1
#define DEBUG_DUMP_CLOCK    1
#define DEBUG_DUMP_PERCLK   1

/*
 *************************************************************
 * local helper functions 
 *************************************************************
 */


/*
 *************************************************************
 * Functions to dump PWR settings
 *************************************************************
 */

const char * const vos_txt[]={"Reserved","Scale 3: 0.95V - 1.05V", "Scale 2: 1.05V - 1.15V","Scale 1: 1.15V - 1.26V", "Overdrive Scale 0: 1.26 V - 1.40 V"};
static const char* DBG_get_pwr_vos_txt(uint32_t sel)
{
  if ( sel < sizeof(vos_txt)/sizeof(char *) ) 
    return vos_txt[sel];
  else
    return "Illegal";
}

static uint32_t get_vos_value (void)
{
#if   defined(STM32H747xx) || defined(STM32H745xx) \
   || defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
    return ( PWR->D3CR & PWR_D3CR_VOS_Msk  ) >> PWR_D3CR_VOS_Pos;
#elif defined(STM32H742xx) || defined(STM32H743xx)
    /* VOSrange 0 is coded as VOSrange 1 PLUS ODEN bit in SYSCFG->PWRCR set */
    uint32_t temp = ( PWR->D3CR & PWR_D3CR_VOS_Msk  ) >> PWR_D3CR_VOS_Pos;
    if ( temp == 0b11 ) 
        if (READ_BIT(SYSCFG->PWRCR, SYSCFG_PWRCR_ODEN)) temp++;
    return temp;
#else
    #error "No algorithm to determine current VOS range"
#endif
}
#if 0
const char * const lpms_txt[]={"Stop 0", "Stop 1", "Stop 2", "Standby" };
static const char* DBG_get_pwr_cr1_lpms_txt(uint32_t sel)
{
  if ( sel > 3 )  return "Shutdown";
    
  return lpms_txt[sel];
}
#endif
const char * als_txt[]={"1.7V", "2.1V", "2.5V", "2.8V" };
static const char* get_pwr_cr1_als_txt(uint32_t sel)
{
  if ( sel < sizeof(als_txt)/sizeof(char *) ) 
    return als_txt[sel];
  else
    return "Illegal";
}

const char * svos_txt[]={"Reserved", "Scale5", "Scale4", "Scale3" };
static const char* get_pwr_cr1_svos_txt(uint32_t sel)
{
  if ( sel < sizeof(svos_txt)/sizeof(char *) ) 
    return svos_txt[sel];
  else
    return "Illegal";
}

const char * const pls_txt[]={"1.95V", "2.1V", "2.25V", "2.4V", "2.55V", "2.7V", "2.85V", "PB7 Ain" };
static const char* get_pwr_cr1_pls_txt(uint32_t sel)
{
  if ( sel < sizeof(pls_txt)/sizeof(char *) ) 
    return pls_txt[sel];
  else
    return "Illegal";
}


#if DEBUG_DUMP_PWR > 0
static void DBG_dump_pwr_cr1(void)
{
  DBG_setPadLen(24);
  DBG_dump_bitvalue("Analog Voltage Det.lvl", PWR->CR1, PWR_CR1_AVDEN);
  DBG_dump_textvalue("Analog Voltage Level", get_pwr_cr1_als_txt(( PWR->CR1 & PWR_CR1_ALS_Msk  ) >> PWR_CR1_ALS_Pos) );
  DBG_dump_textvalue("Vscale in StopMode", get_pwr_cr1_svos_txt(( PWR->CR1 & PWR_CR1_SVOS_Msk  ) >> PWR_CR1_SVOS_Pos) );
  DBG_dump_textvalue("Flash in D1 StopMode ", READ_BIT(PWR->CR1, PWR_CR1_FLPS) ? "LowPower Mode" : "Normal Mode" );
  DBG_dump_bitvalue("Disable BkUp Wr Protect", PWR->CR1, PWR_CR1_DBP);
  DBG_dump_bitvalue("Digital Voltage Det.lvl", PWR->CR1, PWR_CR1_PLS);
  DBG_dump_textvalue("Digital Voltage Level", get_pwr_cr1_pls_txt(( PWR->CR1 & PWR_CR1_PLS_Msk  ) >> PWR_CR1_PLS_Pos) );
  DBG_dump_textvalue("V.lvl in Stop@SVOS3", READ_BIT(PWR->CR1, PWR_CR1_LPDS) ? "LowPower Mode" : "Main Mode" );
}

static void DBG_dump_pwr_csr1(void)
{
  DBG_setPadLen(24);
  DBG_dump_textvalue("Analog Voltage Status", READ_BIT(PWR->CSR1, PWR_CSR1_AVDO) ? "< AV lvl" : ">= AV lvl" );
  DBG_dump_textvalue("current VOS lvl", DBG_get_pwr_vos_txt((PWR->CSR1 & PWR_CSR1_ACTVOS_Msk) >> PWR_CSR1_ACTVOS_Pos));
  DBG_dump_bitvalue( "VOS lvl valid ", PWR->CSR1, PWR_CSR1_ACTVOSRDY);
  DBG_dump_textvalue("Digit. Voltage Status", READ_BIT(PWR->CSR1, PWR_CSR1_PVDO) ? "< V lvl" : ">= V lvl" );
}

static void DBG_dump_pwr_cr3(void)
{
  DBG_setPadLen(24);
  DBG_dump_bitvalue("VddUSB rdy", PWR->CR3, PWR_CR3_USB33RDY);
  DBG_dump_bitvalue("VddUSB Regulator on", PWR->CR3, PWR_CR3_USBREGEN);
  DBG_dump_bitvalue("VddUSB V. detect on", PWR->CR3, PWR_CR3_USB33DEN);
#if defined(PWR_CR3_SMPSEXTRDY)
  DBG_dump_bitvalue("Ext. SMPS rdy", PWR->CR3, PWR_CR3_SMPSEXTRDY);
#endif
#if defined(PWR_CR3_SCUEN)
  DBG_dump_bitvalue("Supply upd enable", PWR->CR3, PWR_CR3_SCUEN);
#endif
  DBG_dump_textvalue("Vbat chrg resistor", READ_BIT(PWR->CR3, PWR_CR3_VBRS) ? "1k5" : "5k0" );
  DBG_dump_bitvalue("Vbat chrg enable", PWR->CR3, PWR_CR3_VBE);
#if defined(PWR_CR3_SMPSEN)
  DBG_dump_bitvalue("SMPS stepdown enable", PWR->CR3, PWR_CR3_SMPSEN);
#endif
  DBG_dump_bitvalue("LDO enable", PWR->CR3, PWR_CR3_LDOEN);
  DBG_dump_bitvalue("PWR mgmt bypass", PWR->CR3, PWR_CR3_BYPASS);
}


static void DBG_dump_pwr_cpu1cr(void)
{
  DBG_setPadLen(24);
  DBG_dump_textvalue("D3 Stop", READ_BIT(PWR->CPUCR, PWR_CPUCR_RUN_D3) ? "keep running" : "Stop when D1 stops" );    
#if defined(PWR_CPUCR_HOLD2)
  DBG_dump_bitvalue("Hold CPU2 after Stop", PWR->CPUCR, PWR_CPUCR_HOLD2);
#endif
  DBG_dump_bitvalue("D2 standby flag", PWR->CPUCR, PWR_CPUCR_SBF_D2);
  DBG_dump_bitvalue("D1 standby flag", PWR->CPUCR, PWR_CPUCR_SBF_D1);
  DBG_dump_bitvalue("System standby flag", PWR->CPUCR, PWR_CPUCR_SBF);
  DBG_dump_bitvalue("System stop flag", PWR->CPUCR, PWR_CPUCR_STOPF);
#if defined(PWR_CPUCR_HOLD2F)
  DBG_dump_bitvalue("D2 on hold flag", PWR->CPUCR, PWR_CPUCR_HOLD2F);
#endif
  DBG_dump_textvalue("D3 on PDD", READ_BIT(PWR->CPUCR, PWR_CPUCR_PDDS_D3) ? "allow Standby" : "continue StopMode" );    
  DBG_dump_textvalue("D2 on PDD", READ_BIT(PWR->CPUCR, PWR_CPUCR_PDDS_D2) ? "allow Standby" : "continue StopMode" );    
  DBG_dump_textvalue("D1 on PDD", READ_BIT(PWR->CPUCR, PWR_CPUCR_PDDS_D1) ? "allow Standby" : "continue StopMode" );    
}

