rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
#if defined(STM32H747xx) || defined(STM32H745xx)
    static void DBG_dump_pwr_cpu2cr(void)
    {
      DBG_setPadLen(24);
      DBG_dump_textvalue("D3 Stop", READ_BIT(PWR->CPU2CR, PWR_CPU2CR_RUN_D3) ? "keep running" : "Stop when D2 stops" );    
      DBG_dump_bitvalue("Hold CPU1 after Stop", PWR->CPU2CR, PWR_CPU2CR_HOLD1);
      DBG_dump_bitvalue("D2 standby flag", PWR->CPU2CR, PWR_CPU2CR_SBF_D2);
      DBG_dump_bitvalue("D1 standby flag", PWR->CPU2CR, PWR_CPU2CR_SBF_D1);
      DBG_dump_bitvalue("System standby flag", PWR->CPU2CR, PWR_CPU2CR_SBF);
      DBG_dump_bitvalue("System stop flag", PWR->CPU2CR, PWR_CPU2CR_STOPF);
      DBG_dump_bitvalue("D1 on hold flag", PWR->CPU2CR, PWR_CPU2CR_HOLD1F);
      DBG_dump_textvalue("D3 on PDD", READ_BIT(PWR->CPU2CR, PWR_CPU2CR_PDDS_D3) ? "allow Standby" : "continue StopMode" );    
      DBG_dump_textvalue("D2 on PDD", READ_BIT(PWR->CPU2CR, PWR_CPU2CR_PDDS_D2) ? "allow Standby" : "continue StopMode" );    
      DBG_dump_textvalue("D1 on PDD", READ_BIT(PWR->CPU2CR, PWR_CPU2CR_PDDS_D1) ? "allow Standby" : "continue StopMode" );    
    }
#endif

static void DBG_dump_pwr_d3cr(void)
{
  DBG_setPadLen(24);
  DBG_dump_textvalue("current VOS lvl", DBG_get_pwr_vos_txt(get_vos_value()));
  DBG_dump_bitvalue("VOS rdy", PWR->D3CR, PWR_D3CR_VOSRDY);
}

/* not all STM32H7 have all wakeup pins connected, 
 * so define a suitable bitmnask 
 */
#if    defined(STM32H747xx) || defined(STM32H745xx)
    || defined(STM32H742xx) || defined(STM32H743xx) 
    #define WAKEUP_PIN_BITMASK 0b00111111
#elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
    #define WAKEUP_PIN_BITMASK 0b00101011
#else
    #error "No Wakeup pin mask defined"
#endif

static void DBG_dump_pwr_wkupfr(void)
{
  DBG_setPadLen(24);
  for ( uint32_t i =0; i<6; i++ ) if ( ( 1 << i ) & WAKEUP_PIN_BITMASK ) {
      DBG_printf_indent("WkUp via WKUP%d Pin: %s\n", i, PWR->WKUPFR & ( 1 << i ) ? "Yes": "No");
  }
}

const char * const pupd_txt[]={"NoPull", "PU", "PD", "Resvd" };
static const char* get_pupd_txt(uint32_t sel)
{
  if ( sel < sizeof(pupd_txt)/sizeof(char *) ) 
    return pupd_txt[sel];
  else
    return "Illegal";
}

static void dump_one_wkup_pin( uint32_t ena, uint32_t pol, uint32_t pupd )
{
   DEBUG_PRINTF("%s %s %s\n",
        ( ena ? "Enabled " : "Disabled" ),
        ( pol ? "Falling" : "Rising "   ),
        get_pupd_txt( pupd )
   );
}
static void DBG_dump_pwr_wkupepr(void)
{
  DBG_setPadLen(24);
  uint32_t ena_pos = PWR_WKUPEPR_WKUPEN1;
  uint32_t pol_pos = PWR_WKUPEPR_WKUPP1;
  uint32_t pupd_mask = PWR_WKUPEPR_WKUPPUPD1_Msk;
  uint32_t pupd_pos = PWR_WKUPEPR_WKUPPUPD1_Pos;
  register uint32_t reg = PWR->WKUPEPR;
  for ( uint32_t i=0; i<6; i++ ) {
    if ( ( 1 << i ) & WAKEUP_PIN_BITMASK ) {
        DBG_printf_indent("WkUp pin %d config: ",i);
        dump_one_wkup_pin(reg & ena_pos, reg & pol_pos, (reg & pupd_mask ) >> pupd_pos);
    }
    ena_pos  <<= 1;
    pol_pos  <<= 1;
    pupd_mask <<= 2;
    pupd_pos += 2;
  }
}

#endif

void DBG_dump_powersetting(void)
{
  DEBUG_PUTS("PWR Settings ------------------------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  #if DEBUG_DUMP_PWR > 0
      /********  PWR Control registers *****************/
      DBG_printf_indent("PWR: Power Control Register 1\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_cr1();
      DBG_setIndentRel(-2);

      DBG_printf_indent("PWR: Power Control&Status Register 1\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_csr1();
      DBG_setIndentRel(-2);

      DBG_printf_indent("PWR: Power Control Register 3 \n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_cr3();
      DBG_setIndentRel(-2);

      DBG_printf_indent("PWR: CPU1 Control Register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_cpu1cr();
      DBG_setIndentRel(-2);

#if defined(STM32H747xx) || defined(STM32H745xx) 
      DBG_printf_indent("PWR: CPU2 Control Register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_cpu2cr();
      DBG_setIndentRel(-2);
#endif 

      DBG_printf_indent("PWR: D3 Control Register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_d3cr();
      DBG_setIndentRel(-2);
 
      DBG_printf_indent("PWR: WakeUp Flag Register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_wkupfr();
      DBG_setIndentRel(-2);
 
      DBG_printf_indent("PWR: WakeUp Enable & Polarity Register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_pwr_wkupepr();
      DBG_setIndentRel(-2);
 
  #else
      DBG_printf_indent("Dumping PWR settings configured out \n" );
  #endif
  DBG_setIndentAbs(oldIndent);
}



/*
 *************************************************************
 * Functions to dump RCC settings
 * Continue here for STM725xx
 *************************************************************
 */


static void dbg_rcc_on_ready ( const char *instname, uint32_t reg, uint32_t on_bit, uint32_t ready_bit )
{
    DBG_dump_bitvalue2(instname, "on", reg, on_bit);
    if ( reg & on_bit ) DBG_dump_bitvalue2(instname, "ready", reg, ready_bit);    
}
/* ---- RCC CR ---- */
static void DBG_dump_rcc_cr(void)
{
  DBG_setPadLen(22);
  dbg_rcc_on_ready("PLL3", RCC->CR, RCC_CR_PLL3ON, RCC_CR_PLL2RDY );
  dbg_rcc_on_ready("PLL2", RCC->CR, RCC_CR_PLL2ON, RCC_CR_PLL2RDY );
  dbg_rcc_on_ready("PLL1", RCC->CR, RCC_CR_PLL1ON, RCC_CR_PLL1RDY );

  dbg_rcc_on_ready("HSE",  RCC->CR, RCC_CR_HSEON,  RCC_CR_HSERDY );
  if ( READ_BIT( RCC->CR, RCC_CR_HSEON ) ) {
    DBG_dump_bitvalue("HSE bypass", RCC->CR, RCC_CR_HSEBYP);
    DBG_dump_bitvalue("HSE CSS on", RCC->CR, RCC_CR_CSSHSEON);
  }

  DBG_dump_bitvalue("D2 Clock ready", RCC->CR, RCC_CR_D2CKRDY );
  DBG_dump_bitvalue("D1 Clock ready", RCC->CR, RCC_CR_D1CKRDY );

  dbg_rcc_on_ready("HSI48", RCC->CR, RCC_CR_HSI48ON, RCC_CR_HSI48RDY );

  dbg_rcc_on_ready("CSI", RCC->CR, RCC_CR_CSION, RCC_CR_CSIRDY );
  DBG_dump_bitvalue("CSI On in STOPmode", RCC->CR, RCC_CR_CSIKERON);

  dbg_rcc_on_ready("HSI", RCC->CR, RCC_CR_HSION, RCC_CR_HSIRDY );
  DBG_dump_bitvalue("HSI On in STOPmode", RCC->CR, RCC_CR_HSIKERON);
  if ( READ_BIT( RCC->CR, RCC_CR_HSION ) ) {
    DBG_dump_number("HSI Frequency (MHz)", 64 >> (( RCC->CR & RCC_CR_HSIDIV_Msk ) >>  RCC_CR_HSIDIV_Pos )  );
    DBG_dump_bitvalue("HSI frac divider", RCC->CR, RCC_CR_HSIDIVF);
  }
}

