rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
const char * const rtcsel_txt[]={"No Clock","LSE","LSI","HSE+RTC prediv"};
static const char* DBG_get_rcc_bdcr_rtcsel_txt(uint32_t sel)
{
  if ( sel < sizeof(rtcsel_txt)/sizeof(char *) ) 
    return rtcsel_txt[sel];
  else
    return "Illegal";
}

/* ---- RCC BDCR ---- */
static void DBG_dump_rcc_bdcr(void)
{
  DBG_setPadLen(16);

  DBG_dump_bitvalue("RTC enable", RCC->BDCR, RCC_BDCR_RTCEN );
  if ( READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) ) {
    DBG_dump_textvalue("RTC/LCD Clk source", DBG_get_rcc_bdcr_rtcsel_txt((RCC->BDCR & RCC_BDCR_RTCSEL_Msk) >> RCC_BDCR_RTCSEL_Pos));
    if ((RCC->BDCR & RCC_BDCR_RTCSEL_Msk)  == RCC_BDCR_RTCSEL_Msk ) {
        uint32_t rtc_presc = (RCC->CFGR & RCC_CFGR_RTCPRE_Msk) >> RCC_CFGR_RTCPRE_Pos;
        if ( rtc_presc < 2 )
            DBG_dump_textvalue("RTC/HSE prescaler","Disabled");
        else 
            DBG_dump_number("RTC/HSE prescaler", rtc_presc);
    }
  }    

  dbg_rcc_on_ready("LSE",  RCC->BDCR, RCC_BDCR_LSEON,  RCC_BDCR_LSERDY );
  dbg_rcc_on_ready("LSI",  RCC->CSR, RCC_CSR_LSION,  RCC_CSR_LSIRDY );
  if ( READ_BIT( RCC->BDCR, RCC_BDCR_LSEON ) ) {
    DBG_dump_bitvalue("LSE bypass", RCC->BDCR, RCC_BDCR_LSEBYP);
    DBG_dump_bitvalue("LSE CSS on", RCC->BDCR, RCC_BDCR_LSECSSON);
    DBG_dump_bitvalue("LSE CSS fault", RCC->BDCR, RCC_BDCR_LSECSSD);
    DBG_dump_number("LSE drv strength", (RCC->BDCR & RCC_BDCR_LSEDRV_Msk) >> RCC_BDCR_LSEDRV_Pos);
  }
}

/* ---- RCC HSICFGR ---- */
static void DBG_dump_rcc_hsicfgr(void)
{
  DBG_setPadLen(16);
  if ( READ_BIT(RCC->CR, RCC_CR_HSION) ) {
    DBG_dump_number("HSI Calibration", (RCC->HSICFGR & RCC_HSICFGR_HSICAL_Msk ) >> RCC_HSICFGR_HSICAL_Pos );
    DBG_dump_number("HSI Trimming", (RCC->HSICFGR & RCC_HSICFGR_HSITRIM_Msk ) >> RCC_HSICFGR_HSITRIM_Pos );
  }
}

/* ---- RCC CFGR ---- */
const char * const mosel1_txt[]={"HSI","LSE", "HSE","PLL1","HSI48"};
static const char* DBG_get_rcc_cfgr_mcosel1_txt(uint32_t sel)
{
  if ( sel < sizeof(mosel1_txt)/sizeof(char *) ) 
    return mosel1_txt[sel];
  else
    return "Illegal";
}

/*
 * decode prescaler values 
 */
static uint32_t count_bits_set (uint32_t arg )
{
    uint32_t ret = 0;

    for ( uint32_t i=0; i < 32; i++ ) {
        if ( arg & 0b1 ) ret++;
        arg >>= 1;
    }

    return ret;
}

static uint32_t decode_prescaler ( uint32_t prescaler, uint32_t relevant_bitnum )
{
    if ( relevant_bitnum == 0 ) return 0;
    uint32_t msb = 1 << ( relevant_bitnum - 1 );

    /* prescaler inactive ( or 1 ) when MSB is reset */
    if ( ( prescaler & msb ) == 0 ) return 1;
    
    /* reset msb */
    prescaler &= ~msb;

    return 1 << ( prescaler + 1 );
}

const char * const sws_txt[]={"HSI","CSI", "HSE", "PLL1"};
static const char* DBG_get_rcc_cfgr_sws_txt(uint32_t sel)
{
  if ( sel < sizeof(sws_txt)/sizeof(char *) ) 
    return sws_txt[sel];
  else
    return "Illegal";
}

static void DBG_dump_rcc_cfgr(void)
{
  DBG_setPadLen(20);
  uint32_t mcopre = ( RCC->CFGR & RCC_CFGR_MCO1PRE_Msk ) >> RCC_CFGR_MCO1PRE_Pos;

  if ( mcopre == 0 ) {
    DBG_printf_indent("MCO disabled\n" );    
  } else {
    DBG_dump_number("MCO prescaler", mcopre );
    DBG_dump_textvalue("MCO Source", DBG_get_rcc_cfgr_mcosel1_txt(( RCC->CFGR & RCC_CFGR_MCO1_Msk ) >> RCC_CFGR_MCO1_Pos) );
  }
  #if defined(RCC_CFGR_HRTIMSEL)
      DBG_dump_textvalue("HRTIM Clksrc", READ_BIT(RCC->CFGR, RCC_CFGR_HRTIMSEL)    ? "CM7 Clk" : "APB1 Clk" );    
  #endif
  DBG_dump_textvalue("System WkUp Clksrc", READ_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK)    ? "CSI" : "HSI" );    
  DBG_dump_textvalue("Kernel WkUp Clksrc", READ_BIT(RCC->CFGR, RCC_CFGR_STOPKERWUCK) ? "CSI" : "HSI" );    
  DBG_dump_textvalue("SysClk source", DBG_get_rcc_cfgr_sws_txt(( RCC->CFGR & RCC_CFGR_SWS_Msk  ) >> RCC_CFGR_SWS_Pos) );
}

/* ---- RCC PLLCFGR ---- */
const char * const pllsrc_txt[]={"HSI", "CSI", "HSE", "No Clock"};
static const char* DBG_get_rcc_pllcfgr_pllsrc_txt(uint32_t sel )
{
  if ( sel < sizeof(pllsrc_txt)/sizeof(char *) ) 
    return pllsrc_txt[sel];
  else
    return "Illegal";
}

/* format a number with a thousand separator */
char *format_kHz( uint32_t khz, char *retbuf, size_t maxlen ) {
    snprintf(retbuf, maxlen, "%d.%03dhKz", khz/1000, khz % 1000 );
    return retbuf;
}

static bool dump_pllconfig( RCC_PLLInitTypeDef *pll, uint32_t pllnum )
{
    uint32_t enableFlags;
    char workbuf[20];
    switch ( pllnum ) {
        case SYS_PLL1:
            pll->PLLSource = (uint32_t)(RCC->PLLCKSELR & RCC_PLLCKSELR_PLLSRC);
            pll->PLLM = (uint32_t) ((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM1)>> RCC_PLLCKSELR_DIVM1_Pos);
            pll->PLLN = (uint32_t) ((RCC->PLL1DIVR & RCC_PLL1DIVR_N1)     >> RCC_PLL1DIVR_N1_Pos)+ 1U;
            pll->PLLR = (uint32_t) ((RCC->PLL1DIVR & RCC_PLL1DIVR_R1)     >> RCC_PLL1DIVR_R1_Pos)+ 1U;
            pll->PLLP = (uint32_t) ((RCC->PLL1DIVR & RCC_PLL1DIVR_P1)     >> RCC_PLL1DIVR_P1_Pos)+ 1U;
            pll->PLLQ = (uint32_t) ((RCC->PLL1DIVR & RCC_PLL1DIVR_Q1)     >> RCC_PLL1DIVR_Q1_Pos)+ 1U;
            pll->PLLRGE =(uint32_t)((RCC->PLLCFGR  & RCC_PLLCFGR_PLL1RGE) >> RCC_PLLCFGR_PLL1RGE_Pos);
            pll->PLLVCOSEL = (uint32_t)((RCC->PLLCFGR & RCC_PLLCFGR_PLL1VCOSEL) >> RCC_PLLCFGR_PLL1VCOSEL_Pos);
            pll->PLLFRACN = (uint32_t)(((RCC->PLL1FRACR & RCC_PLL1FRACR_FRACN1) >> RCC_PLL1FRACR_FRACN1_Pos));
            enableFlags = (uint32_t)((RCC->PLLCFGR  >> RCC_PLLCFGR_DIVP1EN_Pos) &0b111); 
           break;
        case SYS_PLL2:
            pll->PLLSource = (uint32_t)(RCC->PLLCKSELR & RCC_PLLCKSELR_PLLSRC);
            pll->PLLM = (uint32_t)((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM2)>> RCC_PLLCKSELR_DIVM2_Pos);
            pll->PLLN = (uint32_t)((RCC->PLL2DIVR & RCC_PLL2DIVR_N2) >> RCC_PLL2DIVR_N2_Pos)+ 1U;
            pll->PLLR = (uint32_t)((RCC->PLL2DIVR & RCC_PLL2DIVR_R2) >> RCC_PLL2DIVR_R2_Pos)+ 1U;
            pll->PLLP = (uint32_t)((RCC->PLL2DIVR & RCC_PLL2DIVR_P2) >> RCC_PLL2DIVR_P2_Pos)+ 1U;
            pll->PLLQ = (uint32_t)((RCC->PLL2DIVR & RCC_PLL2DIVR_Q2) >> RCC_PLL2DIVR_Q2_Pos)+ 1U;
            pll->PLLRGE =(uint32_t)((RCC->PLLCFGR  & RCC_PLLCFGR_PLL2RGE) >> RCC_PLLCFGR_PLL2RGE_Pos);
            pll->PLLVCOSEL = (uint32_t)((RCC->PLLCFGR & RCC_PLLCFGR_PLL2VCOSEL) >> RCC_PLLCFGR_PLL2VCOSEL_Pos);
            pll->PLLFRACN = (uint32_t)(((RCC->PLL2FRACR & RCC_PLL2FRACR_FRACN2) >> RCC_PLL2FRACR_FRACN2_Pos));
            enableFlags = (uint32_t)((RCC->PLLCFGR  >> RCC_PLLCFGR_DIVP2EN_Pos) &0b111); 
           break;
        case SYS_PLL3:
            pll->PLLSource = (uint32_t)(RCC->PLLCKSELR & RCC_PLLCKSELR_PLLSRC);
            pll->PLLM = (uint32_t)((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM3)>> RCC_PLLCKSELR_DIVM3_Pos);
            pll->PLLN = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_N3) >> RCC_PLL3DIVR_N3_Pos)+ 1U;
            pll->PLLR = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_R3) >> RCC_PLL3DIVR_R3_Pos)+ 1U;
            pll->PLLP = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_P3) >> RCC_PLL3DIVR_P3_Pos)+ 1U;
            pll->PLLQ = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_Q3) >> RCC_PLL3DIVR_Q3_Pos)+ 1U;
            pll->PLLRGE =(uint32_t)((RCC->PLLCFGR  & RCC_PLLCFGR_PLL3RGE) >> RCC_PLLCFGR_PLL3RGE_Pos);
            pll->PLLVCOSEL = (uint32_t)((RCC->PLLCFGR & RCC_PLLCFGR_PLL3VCOSEL) >> RCC_PLLCFGR_PLL3VCOSEL_Pos);
            pll->PLLFRACN = (uint32_t)(((RCC->PLL3FRACR & RCC_PLL3FRACR_FRACN3) >> RCC_PLL3FRACR_FRACN3_Pos));
            enableFlags = (uint32_t)((RCC->PLLCFGR  >> RCC_PLLCFGR_DIVP3EN_Pos) &0b111); 
           break;
        default:
            DBG_printf_indent("Missing decoder for PLL %d\n",pllnum);
            return false;
    }

    DBG_printf_indent("PLL%d configuration\n", pllnum );
    DBG_dump_textvalue("PLL source", DBG_get_rcc_pllcfgr_pllsrc_txt( pll->PLLSource >> RCC_PLLCKSELR_PLLSRC_Pos ) );  
    DBG_dump_number_and_text("PLLM", pll->PLLM, 3, pll->PLLM > 0 ?  "" : "Disabled" );  
    DBG_dump_number_and_text("PLLN", pll->PLLN, 3, "");  
    
