rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
    if (( enableFlags & 0b100 ) != 0) format_kHz(PLL_GetOutFrq(pllnum, PLL_LINE_R),workbuf, 20);
    DBG_dump_number_and_text("PLLR", pll->PLLR, 3, ( enableFlags & 0b100 ) != 0 ? workbuf : "Disabled" );  
    
    if (( enableFlags & 0b010 ) != 0) format_kHz(PLL_GetOutFrq(pllnum, PLL_LINE_Q),workbuf, 20);
    DBG_dump_number_and_text("PLLQ", pll->PLLQ, 3, ( enableFlags & 0b010 ) != 0 ? workbuf : "Disabled" );    

    if (( enableFlags & 0b001 ) != 0) format_kHz(PLL_GetOutFrq(pllnum, PLL_LINE_P),workbuf, 20);
    DBG_dump_number_and_text("PLLP", pll->PLLP, 3, ( enableFlags & 0b001 ) != 0 ? workbuf : "Disabled" );   
    DBG_dump_number_and_text("PLLRGE", pll->PLLRGE, 3, "" );
    DBG_dump_number_and_text("PLLVCOSEL", pll->PLLVCOSEL, 3, "" );
    DBG_dump_number_and_text("PLLFRACN", pll->PLLFRACN, 3, "" ); 
    return true;
} 

static void DBG_dump_rcc_pllcfgr(void)
{
  RCC_PLLInitTypeDef pll;
  DBG_setPadLen(20);

  if ( READ_BIT(RCC->CR, RCC_CR_PLL1ON ) ) {
    dump_pllconfig(&pll, SYS_PLL1);
  } else  {
    DBG_printf_indent("PLL1 disabled\n" );    
  }
  if ( READ_BIT(RCC->CR, RCC_CR_PLL2ON ) ) {
    dump_pllconfig(&pll, SYS_PLL2);
  } else  {
    DBG_printf_indent("PLL2 disabled\n" );    
  }
  if ( READ_BIT(RCC->CR, RCC_CR_PLL3ON ) ) {
    dump_pllconfig(&pll, SYS_PLL3);
  } else  {
    DBG_printf_indent("PLL3 disabled\n" );    
  }
}

static void DBG_dump_rcc_prescalers(void)
{
  DBG_setPadLen(20);
  DBG_dump_number("D1Clk prescaler",   decode_prescaler (  (RCC->D1CFGR & RCC_D1CFGR_D1CPRE_Msk) >> RCC_D1CFGR_D1CPRE_Pos, count_bits_set(RCC_D1CFGR_D1CPRE_Msk) ) );
  DBG_dump_number("AHB Clk prescaler", decode_prescaler (  (RCC->D1CFGR & RCC_D1CFGR_HPRE_Msk  ) >> RCC_D1CFGR_HPRE_Pos,   count_bits_set(RCC_D1CFGR_HPRE_Msk)   ) );
  DBG_dump_number("APB3 Clk prescaler", decode_prescaler( (RCC->D1CFGR & RCC_D1CFGR_D1PPRE_Msk ) >> RCC_D1CFGR_D1PPRE_Pos, count_bits_set(RCC_D1CFGR_D1PPRE_Msk) ) );
  DBG_dump_number("APB1 Clk prescaler", decode_prescaler( (RCC->D2CFGR & RCC_D2CFGR_D2PPRE1_Msk) >> RCC_D2CFGR_D2PPRE1_Pos,count_bits_set(RCC_D2CFGR_D2PPRE1_Msk)) );
  DBG_dump_number("APB2 Clk prescaler", decode_prescaler( (RCC->D2CFGR & RCC_D2CFGR_D2PPRE2_Msk) >> RCC_D2CFGR_D2PPRE2_Pos,count_bits_set(RCC_D2CFGR_D2PPRE2_Msk)) );
  DBG_dump_number("APB4 Clk prescaler", decode_prescaler( (RCC->D3CFGR & RCC_D3CFGR_D3PPRE_Msk ) >> RCC_D3CFGR_D3PPRE_Pos, count_bits_set(RCC_D3CFGR_D3PPRE_Msk) ) );
        
  
}

static void DBG_dump_clocks(void)
{
  RCC_ClkInitTypeDef v;
  uint32_t f_latency;

  DBG_setPadLen(16);
  DBG_dump_number("SYSCLK", HAL_RCC_GetSysClockFreq() );
  DBG_dump_number("HCLK",   HAL_RCC_GetHCLKFreq());
  DBG_dump_number("PCLK1",  HAL_RCC_GetPCLK1Freq());
  DBG_dump_number("PCLK2",  HAL_RCC_GetPCLK2Freq());
  HAL_RCC_GetClockConfig(&v, &f_latency);
  DBG_dump_textvalue("Vcore value", DBG_get_pwr_vos_txt(get_vos_value()));
  DBG_dump_number("Flash Latency", f_latency);  
}


void DBG_dump_clocksetting(void)
{
  DEBUG_PUTS("RCC Settings ------------------------------------" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  Clock Control register *****************/
  DBG_printf_indent("RCC: Clock Control Register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_cr();
  DBG_setIndentRel(-2);

  /********  Backup Domain Control register *****************/
  DBG_printf_indent("RCC: Backup Domain Control Register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_bdcr();
  DBG_setIndentRel(-2);

  /********  MSI/HSI calibration register *****************/
  if (  READ_BIT(RCC->CR, RCC_CR_HSION ) ) {
    DBG_printf_indent("RCC: HSI Calibration Register\n" );
    DBG_setIndentRel(+2);
    DBG_dump_rcc_hsicfgr();
    DBG_setIndentRel(-2);
  }

  /******** Clock configuration register *****************/
  DBG_printf_indent("RCC: Clock configuration register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_cfgr();
  DBG_setIndentRel(-2);

  /******** PLL configuration register *****************/
  DBG_printf_indent("RCC: PLL configuration\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_pllcfgr();
  DBG_setIndentRel(-2);

  /******** Clock prescaler registers *****************/
  DBG_printf_indent("RCC: Clock prescalers\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_prescalers();
  DBG_setIndentRel(-2);

  /******** System Clocks *****************/
  DBG_printf_indent("Resulting System Clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_clocks();
  DBG_setIndentRel(-2);


  DBG_setIndentAbs(oldIndent);
}

/*
 *************************************************************
 * Functions to dump peripheral clock settings
 *************************************************************
 */
#if DEBUG_DUMP_PERCLK > 0

/* Flag for "dump all entries in 'DBG_dump_when_on', not only active ones" */ 
static bool bDumpAlways = false;

void DBG_dump_when_on( const char *txt, uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bitmask)
{
    char const *append;
    /* Only bump, if bit is set */
    if ( !bDumpAlways && (d1 & bitmask) == 0 ) return;
    
    if ( c2 & bitmask && c1 & bitmask ) 
        append = " CM7 CM4";
    else if ( c1 & bitmask )
        append = " CM7";
    else if ( c2 & bitmask )
        append = " CM4";
    else 
        append = "";

    if ( *append )
        DBG_dump_onoffvalue2(txt, d1, bitmask, append);
    else
        DBG_dump_onoffvalue(txt, d1, bitmask );
}

/*
 *************************************************************
 * The follwowing routines are used to dump ordinary and
 * sleep mode register settings, so the register is passed as 
 * parameter. This only works, because bit positions in 
 * ordinary and sleep mode registers are (nearly)identical
 *************************************************************
 */
void DBG_dump_rcc_ahb1enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   AHB1LPENR raw " : "   AHB1ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_AHB1LPENR raw " : "C1_AHB1ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_AHB1LPENR raw " : "C2_AHB1ENR raw ", c2 );  
  }

#if defined(RCC_AHB1ENR_USB2OTGHSEN)
  DBG_dump_when_on ("USB2OTG Clk",    d1, c1, c2, RCC_AHB1ENR_USB2OTGHSEN);  
  DBG_dump_when_on ("USB2 PHY Clk",   d1, c1, c2, RCC_AHB1ENR_USB2OTGHSULPIEN);  
#endif
  DBG_dump_when_on ("USB1 PHY Clk",   d1, c1, c2, RCC_AHB1ENR_USB1OTGHSULPIEN);  
  DBG_dump_when_on ("USB1OTG Clk",    d1, c1, c2, RCC_AHB1ENR_USB1OTGHSEN);  
  DBG_dump_when_on ("ETH1 Rx Clk",    d1, c1, c2, RCC_AHB1ENR_ETH1RXEN);  
  DBG_dump_when_on ("ETH1 Tx Clk",    d1, c1, c2, RCC_AHB1ENR_ETH1TXEN);  
  DBG_dump_when_on ("ETH1 MAC Clk",   d1, c1, c2, RCC_AHB1ENR_ETH1MACEN);  
#if defined(RCC_AHB1ENR_ARTEN)
  DBG_dump_when_on ("ART Clk",        d1, c1, c2, RCC_AHB1ENR_ARTEN);  
#endif
  DBG_dump_when_on ("ADC1,2 Clk",     d1, c1, c2, RCC_AHB1ENR_ADC12EN);  
  DBG_dump_when_on ("DMA2 Clk",       d1, c1, c2, RCC_AHB1ENR_DMA2EN);  
  DBG_dump_when_on ("DMA1 Clk",       d1, c1, c2, RCC_AHB1ENR_DMA1EN);
  DEBUG_PRINTF("\n");
}

void DBG_dump_rcc_ahb2enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   AHB2LPENR raw " : "   AHB2ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_AHB2LPENR raw " : "C1_AHB2ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_AHB2LPENR raw " : "C2_AHB2ENR raw ", c2 );  
  }

  #if defined(RCC_AHB2ENR_SRAM3EN)  
    DBG_dump_when_on ("SRAM3 Clk",   d1, c1, c2, RCC_AHB2ENR_SRAM3EN);  
  #endif
  DBG_dump_when_on ("SRAM2 Clk",   d1, c1, c2, RCC_AHB2ENR_SRAM2EN);  
  DBG_dump_when_on ("SRAM1 Clk",   d1, c1, c2, RCC_AHB2ENR_SRAM1EN);  
  #if defined(CORDIC)
    DBG_dump_when_on ("CORDIC Clk",  d1, c1, c2, RCC_AHB2ENR_CORDICEN);  
  #endif
  #if defined(FMAC)
    DBG_dump_when_on ("FMAC Clk",    d1, c1, c2, RCC_AHB2ENR_FMACEN);  
  #endif
  DBG_dump_when_on ("SDMMC2 Clk",  d1, c1, c2, RCC_AHB2ENR_SDMMC2EN);  
  DBG_dump_when_on ("RNG Clk",     d1, c1, c2, RCC_AHB2ENR_RNGEN);  
#if defined(HASH)
  DBG_dump_when_on ("HASH Clk",    d1, c1, c2, RCC  _AHB2ENR_HASHEN);  
#endif
#if defined(CRYP)
  DBG_dump_when_on ("CRYPT Clk",   d1, c1, c2, RCC_AHB2ENR_CRYPEN);  
#endif
  DBG_dump_when_on ("DCMI Clk",    d1, c1, c2, RCC_AHB2ENR_DCMIEN);  
  DEBUG_PRINTF("\n");
}

void DBG_dump_rcc_ahb3enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   AHB3LPENR raw " : "   AHB3ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_AHB3LPENR raw " : "C1_AHB3ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_AHB3LPENR raw " : "C2_AHB3ENR raw ", c2 );  
  }
 
  if ( bSleepRegisters ) {
      DBG_dump_when_on ("AXISRAM Clk",  d1, c1, c2, RCC_AHB3LPENR_AXISRAMLPEN);  
      DBG_dump_when_on ("ITCM Clk",     d1, c1, c2, RCC_AHB3LPENR_ITCMLPEN);  
      DBG_dump_when_on ("DTCM1 Clk",    d1, c1, c2, RCC_AHB3LPENR_DTCM1LPEN);  
      DBG_dump_when_on ("DTCM2 Clk",    d1, c1, c2, RCC_AHB3LPENR_DTCM2LPEN);  
  }
  #if defined(RCC_AHB3ENR_OTFDEC2EN)
    DBG_dump_when_on ("OTFDEC2 Clk", d1, c1, c2, RCC_AHB3ENR_OTFDEC2EN);
  #endif
  #if defined(RCC_AHB3ENR_OTFDEC1EN)
    DBG_dump_when_on ("OTFDEC1 Clk", d1, c1, c2, RCC_AHB3ENR_OTFDEC1EN);
  #endif
  #if defined(RCC_AHB3ENR_IOMNGREN)
    DBG_dump_when_on ("OSPI IOMGR Clk", d1, c1, c2, RCC_AHB3ENR_IOMNGREN);
  #endif
  #if defined(RCC_AHB3ENR_OSPI2EN)
    DBG_dump_when_on ("OSPI2 Clk",   d1, c1, c2, RCC_AHB3ENR_OSPI2EN);
  #endif
  DBG_dump_when_on ("SDMMC1 Clk",   d1, c1, c2, RCC_AHB3ENR_SDMMC1EN);  
  #if defined(RCC_AHB3ENR_QSPIEN)  
    DBG_dump_when_on ("QSPI Clk",   d1, c1, c2, RCC_AHB3ENR_QSPIEN);  
  #endif
  #if defined(RCC_AHB3ENR_OSPI1EN)
    DBG_dump_when_on ("OSPI1 Clk",   d1, c1, c2, RCC_AHB3ENR_OSPI1EN);
  #endif

  DBG_dump_when_on ("FMC Clk",   d1, c1, c2, RCC_AHB3ENR_FMCEN);  
  #if defined(FLITF)
    DBG_dump_when_on ("FLITF Clk",   d1, c1, c2, RCC_AHB3ENR_FLITFEN);  
  #endif
  #if defined(JPGDEC)
    DBG_dump_when_on ("JPGDEC Clk",   d1, c1, c2, RCC_AHB3ENR_JPGDECEN);  
  #endif
  DBG_dump_when_on ("DMA2D Clk",   d1, c1, c2, RCC_AHB3ENR_DMA2DEN);  
  DBG_dump_when_on ("MDMA Clk",   d1, c1, c2, RCC_AHB3ENR_MDMAEN);  
  DEBUG_PRINTF("\n");
}

