rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
void DBG_dump_rcc_ahb4enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   AHB4LPENR raw " : "   AHB4ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_AHB4LPENR raw " : "C1_AHB4ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_AHB4LPENR raw " : "C2_AHB4ENR raw ", c2 );  
  }

  DBG_dump_when_on ("BKPRAM Clk", d1, c1, c2, RCC_AHB4ENR_BKPRAMEN);  
  DBG_dump_when_on ("HSEM Clk",   d1, c1, c2, RCC_AHB4ENR_HSEMEN);  
  DBG_dump_when_on ("ADC3 Clk",   d1, c1, c2, RCC_AHB4ENR_ADC3EN);  
  DBG_dump_when_on ("BDMA Clk",   d1, c1, c2, RCC_AHB4ENR_BDMAEN);  
  DBG_dump_when_on ("CRC Clk",    d1, c1, c2, RCC_AHB4ENR_CRCEN);  
  DBG_dump_when_on ("GPIOK Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOKEN);  
  DBG_dump_when_on ("GPIOJ Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOJEN);  
  #if defined(GPIOI)
    DBG_dump_when_on ("GPIOI Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOIEN);  
  #endif
  DBG_dump_when_on ("GPIOH Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOHEN);  
  DBG_dump_when_on ("GPIOG Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOGEN);  
  DBG_dump_when_on ("GPIOF Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOFEN);  
  DBG_dump_when_on ("GPIOE Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOEEN);  
  DBG_dump_when_on ("GPIOD Clk",  d1, c1, c2, RCC_AHB4ENR_GPIODEN);  
  DBG_dump_when_on ("GPIOC Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOCEN);  
  DBG_dump_when_on ("GPIOB Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOBEN);  
  DBG_dump_when_on ("GPIOA Clk",  d1, c1, c2, RCC_AHB4ENR_GPIOAEN);  
  DEBUG_PRINTF("\n");
}
 
void DBG_dump_rcc_apb1henr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   APB1HLPENR raw " : "   APB1HENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_APB1HLPENR raw " : "C1_APB1HENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_APB1HLPENR raw " : "C2_APB1HENR raw ", c2 );  
  }

  #if defined(TIM24)
    DBG_dump_when_on ("TIM24 Clk", d1, c1, c2, RCC_APB1HENR_TIM24EN);  
  #endif
  #if defined(TIM23)
    DBG_dump_when_on ("TIM23 Clk", d1, c1, c2, RCC_APB1HENR_TIM23EN);  
  #endif
  DBG_dump_when_on ("FDCAN Clk", d1, c1, c2, RCC_APB1HENR_FDCANEN);  
  DBG_dump_when_on ("MDIOS Clk", d1, c1, c2, RCC_APB1HENR_MDIOSEN);  
  DBG_dump_when_on ("OPAMP Clk", d1, c1, c2, RCC_APB1HENR_OPAMPEN);  
  DBG_dump_when_on ("SWPMI Clk", d1, c1, c2, RCC_APB1HENR_SWPMIEN);  
  DBG_dump_when_on ("CRS Clk", d1, c1, c2, RCC_APB1HENR_CRSEN);  
  DEBUG_PRINTF("\n");
}

void DBG_dump_rcc_apb1lenr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   APB1LLPENR raw " : "   APB1LENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_APB1LLPENR raw " : "C1_APB1LENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_APB1LLPENR raw " : "C2_APB1LENR raw ", c2 );  
  }

  DBG_dump_when_on ("UART8 Clk",    d1, c1, c2, RCC_APB1LENR_UART8EN);  
  DBG_dump_when_on ("UART7 Clk",    d1, c1, c2, RCC_APB1LENR_UART7EN);  
  DBG_dump_when_on ("DAC12 Clk",    d1, c1, c2, RCC_APB1LENR_DAC12EN);  
  DBG_dump_when_on ("CEC Clk",      d1, c1, c2, RCC_APB1LENR_CECEN);  
  DBG_dump_when_on ("CEC Clk",      d1, c1, c2, RCC_APB1LENR_CECEN);
  #if defined(I2C5)
    DBG_dump_when_on ("I2C5 Clk",     d1, c1, c2, RCC_APB1LENR_I2C5EN);  
  #endif
  DBG_dump_when_on ("I2C2 Clk",     d1, c1, c2, RCC_APB1LENR_I2C2EN);  
  DBG_dump_when_on ("I2C1 Clk",     d1, c1, c2, RCC_APB1LENR_I2C1EN);  
  DBG_dump_when_on ("UART5 Clk",    d1, c1, c2, RCC_APB1LENR_UART5EN);  
  DBG_dump_when_on ("UART4 Clk",    d1, c1, c2, RCC_APB1LENR_UART4EN);  
  DBG_dump_when_on ("USART3 Clk",   d1, c1, c2, RCC_APB1LENR_USART3EN);  
  DBG_dump_when_on ("USART2 Clk",   d1, c1, c2, RCC_APB1LENR_USART2EN);  
  DBG_dump_when_on ("SPDIFRX Clk",  d1, c1, c2, RCC_APB1LENR_SPDIFRXEN);  
  DBG_dump_when_on ("SPI3 Clk",     d1, c1, c2, RCC_APB1LENR_SPI3EN);  
  DBG_dump_when_on ("SPI2 Clk",     d1, c1, c2, RCC_APB1LENR_SPI2EN); 
#if defined(WWDG2)
  DBG_dump_when_on ("WWDG2 Clk",    d1, c1, c2, RCC_APB1LENR_WWDG2EN);  
#endif
  DBG_dump_when_on ("LPTIM1 Clk",   d1, c1, c2, RCC_APB1LENR_LPTIM1EN);  
  DBG_dump_when_on ("TIM14 Clk",    d1, c1, c2, RCC_APB1LENR_TIM14EN);  
  DBG_dump_when_on ("TIM13 Clk",    d1, c1, c2, RCC_APB1LENR_TIM13EN);  
  DBG_dump_when_on ("TIM12 Clk",    d1, c1, c2, RCC_APB1LENR_TIM12EN);  
  DBG_dump_when_on ("TIM7 Clk",     d1, c1, c2, RCC_APB1LENR_TIM7EN);  
  DBG_dump_when_on ("TIM6 Clk",     d1, c1, c2, RCC_APB1LENR_TIM6EN);  
  DBG_dump_when_on ("TIM5 Clk",     d1, c1, c2, RCC_APB1LENR_TIM5EN);  
  DBG_dump_when_on ("TIM4 Clk",     d1, c1, c2, RCC_APB1LENR_TIM4EN);  
  DBG_dump_when_on ("TIM3 Clk",     d1, c1, c2, RCC_APB1LENR_TIM3EN);  
  DBG_dump_when_on ("TIM2 Clk",     d1, c1, c2, RCC_APB1LENR_TIM2EN);  
  DEBUG_PRINTF("\n");
}

void DBG_dump_rcc_apb2enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   APB2LPENR raw " : "   APB2ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_APB2LPENR raw " : "C1_APB2ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_APB2LPENR raw " : "C2_APB2ENR raw ", c2 );  
  }

  #if defined(HRTIM)
    DBG_dump_when_on ("HRTIM Clk",    d1, c1, c2, RCC_APB2ENR_HRTIMEN);  
  #endif
  DBG_dump_when_on ("DFSDM1 Clk",   d1, c1, c2, RCC_APB2ENR_DFSDM1EN);  
  #if defined(SAI3)  
    DBG_dump_when_on ("SAI3 Clk",     d1, c1, c2, RCC_APB2ENR_SAI3EN);  
  #endif
  #if defined(SAI2)  
    DBG_dump_when_on ("SAI2 Clk",     d1, c1, c2, RCC_APB2ENR_SAI2EN);
  #endif
  DBG_dump_when_on ("SAI1 Clk",     d1, c1, c2, RCC_APB2ENR_SAI1EN);  
  DBG_dump_when_on ("SPI5 Clk",     d1, c1, c2, RCC_APB2ENR_SPI5EN);  
  DBG_dump_when_on ("TIM17 Clk",    d1, c1, c2, RCC_APB2ENR_TIM17EN);  
  DBG_dump_when_on ("TIM16 Clk",    d1, c1, c2, RCC_APB2ENR_TIM16EN);  
  DBG_dump_when_on ("TIM15 Clk",    d1, c1, c2, RCC_APB2ENR_TIM15EN);  
  DBG_dump_when_on ("SPI4 Clk",     d1, c1, c2, RCC_APB2ENR_SPI4EN);  
  DBG_dump_when_on ("SPI1 Clk",     d1, c1, c2, RCC_APB2ENR_SPI1EN);  
  #if defined(USART10)
    DBG_dump_when_on ("USART10 Clk",  d1, c1, c2, RCC_APB2ENR_USART10EN);  
  #endif 
  #if defined(UART9)
    DBG_dump_when_on ("UART9 Clk",  d1, c1, c2, RCC_APB2ENR_UART9EN);  
  #endif 
  DBG_dump_when_on ("USART6 Clk",   d1, c1, c2, RCC_APB2ENR_USART6EN);  
  DBG_dump_when_on ("USART1 Clk",   d1, c1, c2, RCC_APB2ENR_USART1EN);  
  DBG_dump_when_on ("TIM8 Clk",     d1, c1, c2, RCC_APB2ENR_TIM8EN);  
  DBG_dump_when_on ("TIM1 Clk",     d1, c1, c2, RCC_APB2ENR_TIM1EN);  
  DEBUG_PRINTF("\n");
}

void DBG_dump_rcc_apb3enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   APB3LPENR raw " : "   APB3ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_APB3LPENR raw " : "C1_APB3ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_APB3LPENR raw " : "C2_APB3ENR raw ", c2 );  
  }

  DBG_dump_when_on ("WWDG1 Clk", d1, c1, c2, RCC_APB3ENR_WWDG1EN);  
  #if defined(DSI)
    DBG_dump_when_on ("DSI Clk",   d1, c1, c2, RCC_APB3ENR_DSIEN);
  #endif
  DBG_dump_when_on ("LTDC Clk",  d1, c1, c2, RCC_APB3ENR_LTDCEN);  
  DEBUG_PRINTF("\n");
}

void DBG_dump_rcc_apb4enr(uint32_t d1, uint32_t c1, uint32_t c2, uint32_t bHas2Domains, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "   APB4LPENR raw " : "   APB4ENR raw ", d1 );  
  if ( bHas2Domains ) {
      DBG_dump_uint32_hex(bSleepRegisters ? "C1_APB4LPENR raw " : "C1_APB4ENR raw ", c1 );  
      DBG_dump_uint32_hex(bSleepRegisters ? "C2_APB4LPENR raw " : "C2_APB4ENR raw ", c2 );  
  }
  #if defined(DTS)
    DBG_dump_when_on ("DST Clk",    d1, c1, c2, RCC_APB4ENR_DTSEN);  
  #endif
  DBG_dump_when_on ("SAI4 Clk",   d1, c1, c2, RCC_APB4ENR_SAI4EN);  
  DBG_dump_when_on ("RTCAPB Clk", d1, c1, c2, RCC_APB4ENR_RTCAPBEN);  
  DBG_dump_when_on ("VREF Clk",   d1, c1, c2, RCC_APB4ENR_VREFEN);  
  DBG_dump_when_on ("COMP12 Clk", d1, c1, c2, RCC_APB4ENR_COMP12EN);  
  DBG_dump_when_on ("LPTIM5 Clk", d1, c1, c2, RCC_APB4ENR_LPTIM5EN);  
  DBG_dump_when_on ("LPTIM4 Clk", d1, c1, c2, RCC_APB4ENR_LPTIM4EN);  
  DBG_dump_when_on ("LPTIM3 Clk", d1, c1, c2, RCC_APB4ENR_LPTIM3EN);  
  DBG_dump_when_on ("LPTIM2 Clk", d1, c1, c2, RCC_APB4ENR_LPTIM2EN);  
  DBG_dump_when_on ("I2C4 Clk",   d1, c1, c2, RCC_APB4ENR_I2C4EN);  
  DBG_dump_when_on ("SPI6 Clk",   d1, c1, c2, RCC_APB4ENR_SPI6EN);  
  DBG_dump_when_on ("LPUART1 Clk",d1, c1, c2, RCC_APB4ENR_LPUART1EN);  
  DBG_dump_when_on ("SYSCFG Clk", d1, c1, c2, RCC_APB4ENR_SYSCFGEN);  
  DEBUG_PRINTF("\n");
}
#endif /* #if DEBUG_DUMP_PERCLK > 0 */


