rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
#if defined(STM32H747xx) || defined(STM32H745xx)
    #define MK_4ARGS(a)     RCC_C1->a | RCC_C2->a, RCC_C1->a,  RCC_C2->a, true
#elif defined(STM32H742xx) || defined(STM32H743xx) \
   || defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
    #define MK_4ARGS(a)     RCC->a, 0, 0, false 
#else
    #error "No RCC domain mapping defined"
#endif
void DBG_dump_peripheralclocksetting(bool bDumpAll)
{

  bDumpAlways = bDumpAll;
    
  DEBUG_PUTS("Peripheral Clock Settings -----------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  #if DEBUG_DUMP_PERCLK > 0
      /********  AHB peripheral clock enable register *****************/
      DBG_printf_indent("AHB devices state\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_ahb1enr(MK_4ARGS(AHB1ENR), 0);
      DBG_dump_rcc_ahb2enr(MK_4ARGS(AHB2ENR), 0);
      DBG_dump_rcc_ahb3enr(MK_4ARGS(AHB3ENR), 0);
      DBG_dump_rcc_ahb4enr(MK_4ARGS(AHB4ENR), 0);
      DBG_setIndentRel(-2);

      /********  APB peripheral clock enable register *****************/
      DBG_printf_indent("APB devices state\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_apb1henr(MK_4ARGS(APB1HENR), 0);
      DBG_dump_rcc_apb1lenr(MK_4ARGS(APB1LENR), 0);
      DBG_dump_rcc_apb2enr (MK_4ARGS(APB2ENR) , 0);
      DBG_dump_rcc_apb3enr (MK_4ARGS(APB3ENR) , 0);
      DBG_dump_rcc_apb4enr (MK_4ARGS(APB4ENR) , 0);
      DBG_setIndentRel(-2);

      /********  Backup Domain control register *****************/
      DBG_printf_indent("Backup Domain / RTC clock\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_bdcr();
      DBG_setIndentRel(-2);
  #else
      DBG_printf_indent("configured out\n");
  #endif
  DBG_setIndentAbs(oldIndent);
}

void DBG_dump_peripheralclocksetting_insleepmode(bool bDumpAll)
{
  bDumpAlways = bDumpAll;

  DEBUG_PUTS("Peripheral Clock Settings ** IN SLEEP MODE ** ---" );
  int oldIndent = DBG_setIndentRel(+2);

  #if DEBUG_DUMP_PERCLK > 0
      /********  AHB peripheral clock enable register *****************/
      DBG_printf_indent("AHB devices state ** IN SLEEP MODE **\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_ahb1enr(MK_4ARGS(AHB1LPENR), 1);
      DBG_dump_rcc_ahb2enr(MK_4ARGS(AHB2LPENR), 1);
      DBG_dump_rcc_ahb3enr(MK_4ARGS(AHB3LPENR), 1);
      DBG_dump_rcc_ahb4enr(MK_4ARGS(AHB4LPENR), 1);
      DBG_setIndentRel(-2);

      /********  APB peripheral clock enable register *****************/
      DBG_printf_indent("APB devices state ** IN SLEEP MODE **\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_apb1henr(MK_4ARGS(APB1HLPENR), 1);
      DBG_dump_rcc_apb1lenr(MK_4ARGS(APB1LLPENR), 1);
      DBG_dump_rcc_apb2enr (MK_4ARGS(APB2LPENR) , 1);
      DBG_dump_rcc_apb3enr (MK_4ARGS(APB3LPENR) , 1);
      DBG_dump_rcc_apb4enr (MK_4ARGS(APB4LPENR) , 1);
  #else
      DBG_printf_indent("configured out\n");
  #endif
  DBG_setIndentAbs(oldIndent);
}

const char * const perclk_txt[]={"HSI Clk", "CSI clk", "HSE Clk", "Resvd/Disabled" };
static const char* DBG_get_rcc_perclk_txt(uint32_t sel)
{
  /* 
   * Clock Source 01 on LPTIM1 is deviating from normal bitcode schema
   * so handle specially
   */   
  if ( sel < sizeof(perclk_txt)/sizeof(char *)) 
    return perclk_txt[sel];
  else
    return "Illegal";
}

const char * const hppp_txt[]={"HCLK3", "PLL1Q", "PLL2R", "PER clk" };
static const char* DBG_get_hclk3_pll1q_pll2r_perclk_txt(uint32_t sel)
{
  /* 
   * Clock Source 01 on LPTIM1 is deviating from normal bitcode schema
   * so handle specially
   */   
  if ( sel < sizeof(hppp_txt)/sizeof(char *)) 
    return hppp_txt[sel];
  else
    return "Illegal";
}


#define OUTOF3(sel, a,b,c)          (sel==0?a:(sel==1?b:(sel==2?c:"resvd/disabled")))
#define OUTOF4(sel, a,b,c,d)        (sel==3?d:OUTOF3(sel,a,b,c))
#define OUTOF5(sel, a,b,c,d,e)      (sel==4?e:OUTOF4(sel,a,b,c,d))
#define OUTOF6(sel, a,b,c,d,e,f)    (sel==5?f:OUTOF5(sel,a,b,c,d,e))
#define OUTOF7(sel, a,b,c,d,e,f,g)  (sel==6?g:OUTOF6(sel,a,b,c,d,e,f))

void DBG_dump_peripheralclockconfig(void)
{
  DEBUG_PUTS("Peripheral clock configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(26);

  #if DEBUG_DUMP_PERCLK > 0
      DBG_dump_textvalue("Peripheral Clk Source", DBG_get_rcc_perclk_txt((RCC->D1CCIPR & RCC_D1CCIPR_CKPERSEL_Msk) >> RCC_D1CCIPR_CKPERSEL_Pos) );    

      /* --- D1 Peripherals --- */
      if ( __HAL_RCC_SDMMC1_IS_CLK_ENABLED() || __HAL_RCC_SDMMC2_IS_CLK_ENABLED() ) 
          DBG_dump_textvalue("SDMMC Clk Source", READ_BIT(RCC->D1CCIPR ,RCC_D1CCIPR_SDMMCSEL) ? "PLL2R" : "PLL1Q" );    

      #if defined(DSI)
          if ( __HAL_RCC_DSI_IS_CLK_ENABLED() )
              DBG_printf_indent("*** Not implemented ***");
      #endif

      #if    defined(STM32H747xx) || defined(STM32H745xx) \
          || defined(STM32H742xx) || defined(STM32H743xx)          
          if ( __HAL_RCC_QSPI_IS_CLK_ENABLED() )
                DBG_dump_textvalue("QSPI Clk Source", DBG_get_hclk3_pll1q_pll2r_perclk_txt((RCC->D1CCIPR &  RCC_D1CCIPR_QSPISEL_Msk) >> RCC_D1CCIPR_QSPISEL_Pos) );    
      #elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
          if ( __HAL_RCC_OSPI1_IS_CLK_ENABLED() || __HAL_RCC_OSPI2_IS_CLK_ENABLED() )
                DBG_dump_textvalue("OSPIx Clk Source", DBG_get_hclk3_pll1q_pll2r_perclk_txt((RCC->D1CCIPR &  RCC_D1CCIPR_OCTOSPISEL_Msk) >> RCC_D1CCIPR_OCTOSPISEL_Pos) );    
      #endif

      if ( __HAL_RCC_FMC_IS_CLK_ENABLED() )
          DBG_dump_textvalue("FMC Clk Source", DBG_get_hclk3_pll1q_pll2r_perclk_txt((RCC->D1CCIPR & RCC_D1CCIPR_FMCSEL_Msk) >> RCC_D1CCIPR_FMCSEL_Pos) );    

      /* --- D2 Peripherals --- */
      if ( __HAL_RCC_SWPMI1_IS_CLK_ENABLED() )
          DBG_dump_textvalue("SWPMI Clk Source",  READ_BIT(RCC->D2CCIP1R ,RCC_D2CCIP1R_SWPSEL) ? "HSI" : "PCLK1" ); 
      if ( __HAL_RCC_FDCAN_IS_CLK_ENABLED() )
          DBG_dump_textvalue("FDCAN Clk Source", OUTOF4((RCC->D2CCIP1R & RCC_D2CCIP1R_FDCANSEL_Msk ) >> RCC_D2CCIP1R_FDCANSEL_Pos,"HSE","PLL1Q","PLL2Q","resvd/disable" ));    
      if ( __HAL_RCC_DFSDM1_IS_CLK_ENABLED() )
          DBG_dump_textvalue("DFSDM1 Clk Source",  READ_BIT(RCC->D2CCIP1R ,RCC_D2CCIP1R_SWPSEL) ? "SYSCLK" : "PCLK2" ); 
      if ( __HAL_RCC_SPDIFRX_IS_CLK_ENABLED() )
          DBG_dump_textvalue("SPDIF Clk Source", OUTOF4((RCC->D2CCIP1R & RCC_D2CCIP1R_SPDIFSEL_Msk ) >> RCC_D2CCIP1R_SPDIFSEL_Pos,"PLL1Q","PLL2R","PLL3R","HSI" ));    
      if ( __HAL_RCC_SPI4_IS_CLK_ENABLED() || __HAL_RCC_SPI5_IS_CLK_ENABLED())
          DBG_dump_textvalue("SPI4,5 Clk Source", OUTOF6((RCC->D2CCIP1R & RCC_D2CCIP1R_SPI45SEL_Msk ) >> RCC_D2CCIP1R_SPI45SEL_Pos,"PCLK", "PLL2Q","PLL3Q","HSI","CSI","HSE" ));    
      if ( __HAL_RCC_SPI1_IS_CLK_ENABLED() || __HAL_RCC_SPI2_IS_CLK_ENABLED() || __HAL_RCC_SPI3_IS_CLK_ENABLED() )
          DBG_dump_textvalue("SPI1,2,3 Clk Source", OUTOF5((RCC->D2CCIP1R & RCC_D2CCIP1R_SPI123SEL_Msk ) >> RCC_D2CCIP1R_SPI123SEL_Pos,"PLL1Q", "PLL2P","PLL3P","I2S_IN","PER" ));    
      if ( __HAL_RCC_SAI1_IS_CLK_ENABLED() )
          DBG_dump_textvalue("SPI1,2,3 Clk Source", OUTOF5((RCC->D2CCIP1R & RCC_D2CCIP1R_SPI123SEL_Msk ) >> RCC_D2CCIP1R_SPI123SEL_Pos,"PLL1Q", "PLL2P","PLL3P","I2S_IN","PER" ));    

      if ( __HAL_RCC_LPTIM1_IS_CLK_ENABLED() )
          DBG_dump_textvalue("LPTIM1 Clk Source", OUTOF6((RCC->D2CCIP2R & RCC_D2CCIP2R_LPTIM1SEL_Msk ) >> RCC_D2CCIP2R_LPTIM1SEL_Pos,"PCLK1", "PLL2P","PLL3R","LSE","LSI","PER" ));        
      if ( __HAL_RCC_CEC_IS_CLK_ENABLED() )
          DBG_dump_textvalue("CEC Clk Source", OUTOF3((RCC->D2CCIP2R & RCC_D2CCIP2R_CECSEL_Msk ) >> RCC_D2CCIP2R_CECSEL_Pos,"LSE", "LSI", "CSI"));        

      #if    defined(STM32H747xx) || defined(STM32H745xx) \
          || defined(STM32H742xx) || defined(STM32H743xx)          
          if ( __HAL_RCC_USB1_OTG_HS_IS_CLK_ENABLED() || __HAL_RCC_USB2_OTG_FS_IS_CLK_ENABLED() )
              DBG_dump_textvalue("USB Clk Source", OUTOF4((RCC->D2CCIP2R & RCC_D2CCIP2R_USBSEL_Msk ) >> RCC_D2CCIP2R_USBSEL_Pos,"Disabled", "PLL1Q", "PLL3Q","HSI48"));        
      #elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
          if ( __HAL_RCC_USB1_OTG_HS_IS_CLK_ENABLED() )
              DBG_dump_textvalue("USB Clk Source", OUTOF4((RCC->D2CCIP2R & RCC_D2CCIP2R_USBSEL_Msk ) >> RCC_D2CCIP2R_USBSEL_Pos,"Disabled", "PLL1Q", "PLL3Q","HSI48"));        
      #endif
      #if    defined(STM32H747xx) || defined(STM32H745xx) \
          || defined(STM32H742xx) || defined(STM32H743xx)          
          if ( __HAL_RCC_I2C1_IS_CLK_ENABLED() || __HAL_RCC_I2C2_IS_CLK_ENABLED() || __HAL_RCC_I2C3_IS_CLK_ENABLED() )
              DBG_dump_textvalue("I2C1,2,3 Clk Source", OUTOF4((RCC->D2CCIP2R & RCC_D2CCIP2R_I2C123SEL_Msk ) >> RCC_D2CCIP2R_I2C123SEL_Pos,"PCLK1", "PLL3R", "HSI","CSI"));        
      #elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
          if ( __HAL_RCC_I2C1_IS_CLK_ENABLED() || __HAL_RCC_I2C2_IS_CLK_ENABLED() || __HAL_RCC_I2C3_IS_CLK_ENABLED() || __HAL_RCC_I2C5_IS_CLK_ENABLED() )
              DBG_dump_textvalue("I2C1,2,3,5 Clk Source", OUTOF4((RCC->D2CCIP2R & RCC_D2CCIP2R_I2C1235SEL_Msk ) >> RCC_D2CCIP2R_I2C1235SEL_Pos,"PCLK1", "PLL3R", "HSI","CSI"));        
      #endif

