rainer20512/stm32-fw/stm32h7/common_h7/Src/debug_pwr_rcc.c
      if ( __HAL_RCC_RNG_IS_CLK_ENABLED() )
          DBG_dump_textvalue("RNG Clk Source", OUTOF4((RCC->D2CCIP2R & RCC_D2CCIP2R_RNGSEL_Msk ) >> RCC_D2CCIP2R_RNGSEL_Pos,"HSI48", "PLL1Q", "LSE","LSI"));        
      #if    defined(STM32H747xx) || defined(STM32H745xx) \
          || defined(STM32H742xx) || defined(STM32H743xx)          
          if ( __HAL_RCC_USART1_IS_CLK_ENABLED() || __HAL_RCC_USART6_IS_CLK_ENABLED() )
              DBG_dump_textvalue("USART1,6 Clk Source", OUTOF6((RCC->D2CCIP2R & RCC_D2CCIP2R_USART16SEL_Msk ) >> RCC_D2CCIP2R_USART16SEL_Pos,"PCLK2", "PLL2Q","PLL3Q","HSI","CSI","LSE" ));    
      #elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
          if ( __HAL_RCC_USART1_IS_CLK_ENABLED() || __HAL_RCC_USART6_IS_CLK_ENABLED() || __HAL_RCC_UART9_IS_CLK_ENABLED() || __HAL_RCC_USART10_IS_CLK_ENABLED() )
              DBG_dump_textvalue("USART1,6,9,10 Clk Source", OUTOF6((RCC->D2CCIP2R & RCC_D2CCIP2R_USART16910SEL_Msk ) >> RCC_D2CCIP2R_USART16910SEL_Pos,"PCLK2", "PLL2Q","PLL3Q","HSI","CSI","LSE" ));    
      #endif
      if (  __HAL_RCC_USART2_IS_CLK_ENABLED() || __HAL_RCC_USART3_IS_CLK_ENABLED() 
          || __HAL_RCC_UART4_IS_CLK_ENABLED() || __HAL_RCC_UART5_IS_CLK_ENABLED() || __HAL_RCC_UART7_IS_CLK_ENABLED() || __HAL_RCC_UART8_IS_CLK_ENABLED() )
          DBG_dump_textvalue("U(S)ART2-5,7,8 Clk Source", OUTOF6((RCC->D2CCIP2R & RCC_D2CCIP2R_USART28SEL_Msk ) >> RCC_D2CCIP2R_USART28SEL_Pos,"PCLK1", "PLL2Q","PLL3Q","HSI","CSI","LSE" ));    

      /* D3 Peripherals */

      #if    defined(STM32H747xx) || defined(STM32H745xx) \
          || defined(STM32H742xx) || defined(STM32H743xx)          
          if ( __HAL_RCC_SPI6_IS_CLK_ENABLED() )
              DBG_dump_textvalue("SPI6 Clk Source", OUTOF6((RCC->D3CCIPR & RCC_D3CCIPR_SPI6SEL_Msk ) >> RCC_D3CCIPR_SPI6SEL_Pos, "PCLK4", "PLL2Q","PLL3Q","HSI","CSI","HSE" ));    
          if ( __HAL_RCC_SAI4_IS_CLK_ENABLED() ) {
              DBG_dump_textvalue("SAI4B Clk Source", OUTOF5((RCC->D3CCIPR & RCC_D3CCIPR_SAI4BSEL_Msk ) >> RCC_D3CCIPR_SAI4BSEL_Pos, "PLL1Q", "PLL2P","PLL3P","I2S_IN","PER" ));    
              DBG_dump_textvalue("SAI4A Clk Source", OUTOF5((RCC->D3CCIPR & RCC_D3CCIPR_SAI4ASEL_Msk ) >> RCC_D3CCIPR_SAI4ASEL_Pos, "PLL1Q", "PLL2P","PLL3P","I2S_IN","PER" ));    
          }
      #elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
          /* This types have some more config options */
          if ( __HAL_RCC_SPI6_IS_CLK_ENABLED() )
              DBG_dump_textvalue("SPI6 Clk Source", OUTOF7((RCC->D3CCIPR & RCC_D3CCIPR_SPI6SEL_Msk ) >> RCC_D3CCIPR_SPI6SEL_Pos, "PCLK4", "PLL2Q","PLL3Q","HSI","CSI","HSE","I2S_IN" ));    
          if ( __HAL_RCC_SAI4_IS_CLK_ENABLED() ) {
              DBG_dump_textvalue("SAI4B Clk Source", OUTOF6((RCC->D3CCIPR & RCC_D3CCIPR_SAI4BSEL_Msk ) >> RCC_D3CCIPR_SAI4BSEL_Pos, "PLL1Q", "PLL2P","PLL3P","I2S_IN","PER","SPDIFRX_SYMB" ));    
              DBG_dump_textvalue("SAI4A Clk Source", OUTOF6((RCC->D3CCIPR & RCC_D3CCIPR_SAI4ASEL_Msk ) >> RCC_D3CCIPR_SAI4ASEL_Pos, "PLL1Q", "PLL2P","PLL3P","I2S_IN","PER","SPDIFRX_SYMB" ));    
          }
      #endif
      if ( __HAL_RCC_ADC12_IS_CLK_ENABLED() || __HAL_RCC_ADC3_IS_CLK_ENABLED() )
          DBG_dump_textvalue("ADC1,2,3 Clk Source", OUTOF3((RCC->D3CCIPR & RCC_D3CCIPR_ADCSEL_Msk ) >> RCC_D3CCIPR_ADCSEL_Pos, "PLL2P", "PLL3R","PER" ));    
      if ( __HAL_RCC_LPTIM3_IS_CLK_ENABLED() || __HAL_RCC_LPTIM4_IS_CLK_ENABLED() || __HAL_RCC_LPTIM5_IS_CLK_ENABLED() )
          DBG_dump_textvalue("LPTIM3,4,5 Clk Source", OUTOF6((RCC->D3CCIPR & RCC_D3CCIPR_LPTIM345SEL_Msk ) >> RCC_D3CCIPR_LPTIM345SEL_Pos, "PCLK4", "PLL2P","PLL3R","LSE","LSI","PER" ));     
      if ( __HAL_RCC_LPTIM2_IS_CLK_ENABLED() )
          DBG_dump_textvalue("LPTIM2 Clk Source", OUTOF6((RCC->D3CCIPR & RCC_D3CCIPR_LPTIM2SEL_Msk ) >> RCC_D3CCIPR_LPTIM2SEL_Pos, "PCLK4", "PLL2P","PLL3R","LSE","LSI","PER" ));     
  #else
      DBG_printf_indent("configured out\n");
  #endif

  DBG_setIndentAbs(oldIndent);
}

typedef struct
{
  __IO uint32_t CR;     /*!< DMA stream x configuration register      */
  __IO uint32_t NDTR;   /*!< DMA stream x number of data register     */
  __IO uint32_t PAR;    /*!< DMA stream x peripheral address register */
  __IO uint32_t M0AR;   /*!< DMA stream x memory 0 address register   */
  __IO uint32_t M1AR;   /*!< DMA stream x memory 1 address register   */
  __IO uint32_t FCR;    /*!< DMA stream x FIFO control register       */
} xDMA_Stream_TypeDef;

#define GET_BIT(reg, mask )        ( reg & mask ? 1 : 0)
#define GET_2BIT(reg, mask, pos)   ( ( reg & mask ) >> pos )
const uint32_t burst_txt[] = { 1, 4, 8, 16 };
const char *dir_txt[] = {"Perip->Mem", "Mem->Perip", "Mem->Mem  ", "reserved  "};
const char *size_txt[] = {"8Bit ", "16Bit", "32Bit", "resvd"};

void DBG_dump_one_DMAStream (uint32_t idx, bool bOnlyActive, DMA_Stream_TypeDef *stream)
{
    uint32_t cr = stream->CR;
    if ( bOnlyActive && GET_BIT(cr, DMA_SxCR_EN) == 0 ) return;
    DBG_printf_indent("Stream# raw: 0x%08x\n", cr); 
    DBG_printf_indent("Stream#%d: En=%d, MBurst=%d, PBurst=%d, TrBuff=%d, DBM=%d, Pri=%d\n", 
         idx, GET_BIT(cr, DMA_SxCR_EN), burst_txt[GET_2BIT(cr, DMA_SxCR_MBURST_Msk, DMA_SxCR_MBURST_Pos)],
          burst_txt[GET_2BIT(cr, DMA_SxCR_PBURST_Msk, DMA_SxCR_PBURST_Pos)], GET_BIT(cr, (1 <<20 )), GET_BIT(cr, DMA_SxCR_DBM), GET_2BIT(cr, DMA_SxCR_PL_Msk, DMA_SxCR_PL_Pos) );
    DBG_printf_indent("   Circ=%d Dir=%s, PfCtrl=%d, TCIE=%d, HTIE=%d\n",
          GET_BIT(cr, DMA_SxCR_CIRC), dir_txt[GET_2BIT(cr, DMA_SxCR_DIR_Msk, DMA_SxCR_DIR_Pos)], GET_BIT(cr, DMA_SxCR_PFCTRL), GET_BIT(cr, DMA_SxCR_TCIE), GET_BIT(cr, DMA_SxCR_HTIE) );  
    DBG_printf_indent("   MemAddr0=0x%08x %s, MemAddr1=0x%08x %s, Size=%s, Inc=%d\n", 
          stream->M0AR, GET_BIT(cr, DMA_SxCR_CT) == 0 ? "(act)":"", stream->M1AR, GET_BIT(cr, DMA_SxCR_CT) == 1 ? "(act)":"",
          size_txt[GET_2BIT(cr, DMA_SxCR_MSIZE_Msk, DMA_SxCR_MSIZE_Pos)], GET_BIT(cr, DMA_SxCR_MINC) );
    DBG_printf_indent("   PeripAddr=0x%08x Size=%s, Inc=%d %s\n", 
          stream->PAR, size_txt[GET_2BIT(cr, DMA_SxCR_PSIZE_Msk, DMA_SxCR_PSIZE_Pos)], GET_BIT(cr, DMA_SxCR_PINC),
          GET_BIT(cr, DMA_SxCR_PINC) && GET_BIT(cr, DMA_SxCR_PINCOS) ? "Ofs32" : ""  );
           
    DBG_printf_indent("   Count=0x%08x FifoTH=%d,\n", 
          stream->NDTR, GET_2BIT(stream->FCR, DMA_SxFCR_FTH_Msk, DMA_SxFCR_FTH_Pos));
}

void DBG_dump_DMA ( uint32_t dmanum )
{
    uint32_t DMA_Base = ( dmanum == 1 ? DMA1_BASE : DMA2_BASE );
    DMA_Stream_TypeDef *stream;
    DBG_printf_indent("DMA%d Controller------------------\n",dmanum);
    int oldIndent = DBG_setIndentRel(+2);
    for ( uint32_t i = 0; i < 8; i++ ) {
        stream = ( DMA_Stream_TypeDef *)(DMA_Base + 0x10 + i *0x18);
        DBG_dump_one_DMAStream (i, true, stream);
    }
    DBG_setIndentAbs(oldIndent);
}

void DBG_dump_all_DMA (void )
{
  DEBUG_PUTS("DMA configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(18);

  DBG_dump_DMA(1);
  DBG_dump_DMA(2);

  DBG_setIndentAbs(oldIndent);
}

void DBG_dump_rtcclockconfig(void)
{
  DEBUG_PUTS("Peripheral clock configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(18);

  DBG_printf_indent("Not implemented yet");

  DBG_setIndentAbs(oldIndent);
}

#endif // #if DEBUG_FEATURES > 0

/**
  * @}
  */
